blast-pure/0.orig/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet_x
    {
        type            fixedValue;
        value           uniform 0.23;
    }
    
    inlet_-x
    {
        type            fixedValue;
        value           uniform 0.23;
    }
    
    inlet_y
    {
        type            fixedValue;
        value           uniform 0.23;
    }
    
    inlet_-y
    {
        type            fixedValue;
        value           uniform 0.23;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    walls
    {
        type            fixedValue;
        value		uniform 0;
    }
}


// ************************************************************************* //
