blast-pure/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_x
    {
        type            fixedValue;
        value           uniform (50 0 0);
    }
    
    inlet_-x
    {
        type            fixedValue;
        value           uniform (-50 0 0);
    }
    
    inlet_y
    {
        type            fixedValue;
        value           uniform (0 50 0);
    }
    
    inlet_-y
    {
        type            fixedValue;
        value           uniform (0 -50 0);
    }
    
    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      $internalField;
        value           $internalField;
    }
    
    walls
    {
        type            fixedValue;
        value           $internalField;
    }
}

