blast-pure/0.orig/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 2.3.1                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    "(inlet_x|inlet_-x|inlet_y|inlet_-y)"
    {
        type            fixedValue;
        value           uniform 0;  // Замените на нужное значение
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;  // Замените на нужное значение
    }
}

// ************************************************************************* //

