blast-pure/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            patch;
        nFaces          249;
        startFace       62453;
    }
    walls
    {
        type            wall;
        nFaces          6108;
        startFace       62702;
    }
    inlet_x
    {
        type            patch;
        nFaces          24;
        startFace       68810;
    }
    inlet_-y
    {
        type            patch;
        nFaces          27;
        startFace       68834;
    }
    inlet_y
    {
        type            patch;
        nFaces          27;
        startFace       68861;
    }
    inlet_-x
    {
        type            patch;
        nFaces          27;
        startFace       68888;
    }
)

// ************************************************************************* //
