blast-pure/constant/reactions
elements
(
O
N
);


species
(
    O2
    N2
);

reactions
{};
